#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/example-org-f66d79/dns-main/runs/run-8zKUdCPjhxiujY4j

Waiting for the plan to start...

Terraform v1.3.9
on linux_amd64
Initializing plugins and modules...
data.aws_route53_zone.selected: Reading...
data.aws_route53_zone.selected: Read complete after 1s [id=Z1ZGYX2ZIYACUH]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.terraform-subzone will be created
  + resource "aws_route53_zone" "terraform-subzone" {
      + arn                 = (known after apply)
      + comment             = "All subdomains created by terraform will be created here"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "tf.therealbenforce.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags_all            = (known after apply)
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  - hosted_zone_id = "foo" -> null
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "ZONE_ID" but a value was
│ found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-8zKUdCPjhxiujY4j/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-8zKUdCPjhxiujY4j/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Values for undeclared variables
│ 
│ In addition to the other similar warnings shown, 1 other variable(s)
│ defined without being declared.
╵

```

</details>

*Pushed by: @TheRealBenForce, Action: `pull_request`*